
const stuff = [
    [
        '♈',
        '♉',
        '♊',
        '♋',
        '♌',
    ], [
        '♍',
        '♎',
    ], [
        [
            '♏',
            '♐',
            '♑',
        ],
        [
            '♒',
            '♓',
        ],
        [
            '🌸',
            '🌷',
            '🌹',
            '🌺',
        ]
    ], [
        '🌻',
        '🌼',
        '🌽',
    ],[
        [
            { value: '🍅' },
            { value: '🍎' },
        ], [
            { value: '🍏' },
            { get: () => '🍑' },
        ], [
            { get: () => '🍒' },
            { get: () => '🍓' },
        ],
    ]
];


/**
 * Из представленного массива stuff необходимо заполнить
 * константы zodiacSigns, flowers, food соответственно
 * знаками задиака, цветами и съедобными объектами.
 * Значения должны получиться плоскими массивами
 * без оберток в виде объектов и методов вида:
 * 🍅 🍎 🍏 🍑 🍒 🍓
 * Попробуйте написать как можно меньше кода для достижения
 * результата.
 */

let [zodi,zodi1,any,flo2,any2] = stuff;

let [zodi2,zodi3,flo1] = any;

let [fruit,fruit1,fruit2] = any2;
const any3=any2.map



const zodiacSigns = [...zodi, ...zodi1, ...zodi2, ...zodi3];

const flowers = [...flo1, ...flo2];

const food =[...fruit,...fruit1,...fruit2];




